---
kind: property
id: P:Autodesk.Revit.DB.Analysis.AnalysisDisplayVectorSettings.VectorOrientation
source: html/2948b555-cddd-4bd3-ce6c-4fb85ea32284.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayVectorSettings.VectorOrientation Property

Vector orientation.

## Syntax (C#)
```csharp
public AnalysisDisplayStyleVectorOrientation VectorOrientation { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration